Revit 2027 API
ImageInstance.EnableSnaps Property
 When true the ImageInstance will have its snaps enabled, but only if CanHaveSnaps is true
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool EnableSnaps { get; set; }
Public Property EnableSnaps As Boolean
	Get
	Set
public:
property bool EnableSnaps {
	bool get ();
	void set (bool value);
}
member EnableSnaps : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The image does not have snaps
See Also
Reference
ImageInstance Class
Autodesk.Revit.DB Namespace